Revit 2027 API
NurbsSurfaceData.GetWeight Method
 Get the weight.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double GetWeight(
	int idx
)
Public Function GetWeight (
	idx As Integer
) As Double
public:
double GetWeight(
	int idx
)
member GetWeight :
        idx : int -> float
Parameters
idx Int32
 The index of the weight.
Return Value
Double
Exceptions
Exception | Condition
ArgumentException |  Out-of-range access.
See Also
Reference
NurbsSurfaceData Class
Autodesk.Revit.DB Namespace